app/controllers/admin/dashboard_controller.rb

  def index
    @users = User.all.order(created_at: :desc)
    @blog_posts = BlogPost.all.order(created_at: :desc)
---
SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC
SELECT "blog_posts".* FROM "blog_posts" ORDER BY "blog_posts"."created_at" DESC