app/controllers/admin/users_controller.rb

INSERT INTO "users" ("email", "encrypted_password", "name", "reset_password_token", "reset_password_sent_at", "remember_created_at", "created_at", "updated_at", "admin", "stripe_customer_id", "paying_customer", "stripe_subscription_id", "permissions") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
---
  def invite
    email = params[:email]
    name = params[:name]

    User.create!(email: email, name: name)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def set_user
    @user = User.find_by_id(params[:id])