app/views/blog_posts/_form.html.erb

              <%= form.label :avaliador, class: "block text-sm font-medium text-gray-700" %>
              <%= form.select :reviewer, User.reviewers.all.map { |user| [user.name, user.name] }, { prompt: 'Selecionar avaliador' }, {class: "mt-1 block w-full pl-3 pr-10 py-2 text-base border-gray-300 focus:outline-none sm:text-sm rounded-md" } %>
---
SELECT "users".* FROM "users" WHERE (permissions @> ARRAY['review']::varchar[])