app/views/blog_posts/show.html.erb

SELECT "users".* FROM "users" WHERE (permissions @> ARRAY['review']::varchar[])
---
                        <div class="field">
                          <%= form.select :name, User.reviewers.all.map { |user| [user.name, user.name] }, { prompt: 'Selecionar avaliador' }, { onchange: 'this.form.submit();', class: "mt-1 block w-full pl-3 pr-10 py-2 text-base border-gray-300 focus:outline-none sm:text-sm rounded-md" } %>