app/controllers/blog_posts_controller.rb

SELECT "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."published" = $1 ORDER BY "blog_posts"."created_at" ASC  [["published", true]]
---
  def index
   @blog_posts = BlogPost.all.order(created_at: :asc).where(published: true)

SELECT "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."draft" = $1 ORDER BY "blog_posts"."created_at" ASC  [["draft", false]]
---
  def artigos
    @blog_posts = BlogPost.all.order(created_at: :asc).where(draft: false)

SELECT "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."reviewer" = $1 AND "blog_posts"."draft" = $2 ORDER BY "blog_posts"."created_at" ASC  [["reviewer", "Cleiton"], ["draft", true]]
---
  def review
    @blog_posts = BlogPost.all.order(created_at: :asc).where(reviewer: current_user.name).where(draft: true)

SELECT "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."draft" = $1 AND "blog_posts"."published" = $2 ORDER BY "blog_posts"."created_at" ASC  [["draft", true], ["published", false]]
---
  def write
    @blog_posts = BlogPost.all.order(created_at: :asc).where(draft: true, published: false)

SELECT "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "blog_posts" SET "updated_at" = $1, "published" = $2 WHERE "blog_posts"."id" = $3  [["updated_at", "2024-03-26 01:02:31.553938"], ["published", true], ["id", 3]]
---
  def approve
    @blog_post = BlogPost.find(params[:id])
    @blog_post.update(draft: false)

SELECT "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "blog_posts" SET "updated_at" = $1, "reviewer" = $2 WHERE "blog_posts"."id" = $3  [["updated_at", "2024-03-26 01:11:38.131249"], ["reviewer", "Cleiton"], ["id", 2]]
---
  def publish
    @blog_post = BlogPost.find(params[:id])
    @blog_post.update(published: true)

SELECT "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "blog_posts" SET "updated_at" = $1 WHERE "blog_posts"."id" = $2  [["updated_at", "2024-03-26 23:01:03.505074"], ["id", 7]]
---
  def assign
    @blog_post = BlogPost.find(params[:id])
    @blog_post.update(reviewer: params[:name])

INSERT INTO "blog_posts" ("title", "slug", "description", "draft", "created_at", "updated_at", "published", "reviewer") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @blog_post = BlogPost.new(blog_post_params)

    if @blog_post.save

UPDATE "blog_posts" SET "updated_at" = $1 WHERE "blog_posts"."id" = $2  [["updated_at", "2024-03-26 23:01:21.081055"], ["id", 7]]
---
  def update
    @blog_post.slug = params[:blog_post][:slug]
    if @blog_post.save && @blog_post.update(blog_post_params)

DELETE FROM "blog_posts" WHERE "blog_posts"."id" = $1  [["id", 3]]
---
  def destroy
    @blog_post.destroy

SELECT 1 AS one FROM "blog_posts" WHERE "blog_posts"."slug" = $1 AND "blog_posts"."id" != $2 LIMIT $3  [["slug", "teste-novo-avaliador"], ["id", 6], ["LIMIT", 1]]
SELECT "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."slug" = $1 LIMIT $2  [["slug", "pneumoterapia"], ["LIMIT", 1]]
SELECT "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."slug" = $1 LIMIT $2  [["slug", "teste-novo-avaliador"], ["LIMIT", 1]]
---
  def set_blog_post
    slug = params[:blog_post].present? ? params[:blog_post][:slug] : params[:slug]
    @blog_post = BlogPost.find_by!(slug: slug)