app/controllers/blog_posts_controller.rb

  def index
    redirect_to admin_dashboard_index_path if current_user&.admin?

    @blog_posts = BlogPost.all.order(created_at: :asc).where(draft: true)
---
SELECT "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."draft" = $1 ORDER BY "blog_posts"."created_at" ASC  [["draft", false]]

  def create
    @blog_post = BlogPost.new(blog_post_params)

    if @blog_post.save
---
INSERT INTO "blog_posts" ("title", "slug", "description", "draft", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "test"], ["slug", "t123123a"], ["description", "a"], ["draft", nil], ["created_at", "2024-03-25 23:57:04.588606"], ["updated_at", "2024-03-25 23:57:04.588606"]]

  def destroy
    @blog_post.destroy
---
DELETE FROM "blog_posts" WHERE "blog_posts"."id" = $1  [["id", 4]]

  def set_blog_post
    slug = params[:blog_post].present? ? params[:blog_post][:slug] : params[:slug]
    @blog_post = BlogPost.find_by!(slug: slug)
---
SELECT "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."slug" = $1 LIMIT $2  [["slug", "a"], ["LIMIT", 1]]
SELECT 1 AS one FROM "blog_posts" WHERE "blog_posts"."slug" = $1 AND "blog_posts"."id" != $2 LIMIT $3  [["slug", "professor"], ["id", 7], ["LIMIT", 1]]
SELECT "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."slug" = $1 LIMIT $2  [["slug", "t123123a"], ["LIMIT", 1]]