app/controllers/dashboard_controller.rb

SELECT "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."draft" = $1  [["draft", false]]
---
  def index
    @blog_posts = BlogPost.all.where(draft: false)