app/controllers/dashboard_controller.rb

  def index
    @blog_posts = BlogPost.all.where(published: true)
---
SELECT "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."published" = $1  [["published", true]]