app/models/blog_post.rb

SELECT 1 AS one FROM "blog_posts" WHERE (slug LIKE 'pneumoterapia%') LIMIT $1  [["LIMIT", 1]]
SELECT 1 AS one FROM "blog_posts" WHERE (slug LIKE 't%') LIMIT $1  [["LIMIT", 1]]
SELECT COUNT(*) FROM "blog_posts" WHERE (slug LIKE 'a%')
---
  def generate_unique_slug
    if new_record? || slug_changed?
      base_slug = slug.blank? ? title.parameterize : slug
      other = self.class.where("slug LIKE ?", "#{base_slug}%")
      self.slug = if other.exists?
                    "#{base_slug}-#{other.count + 1}"